Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.4.57/samg54/edc/ATSAMG54J19.PIC
      <edc:SFRDef edc:_addr="0x40010088" edc:access="------------------------------nn" edc:cname="TC_CHANNEL2TC0_SMMR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="Gray Count Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DOWN" edc:desc="Down Count" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001008C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40010090" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TC_CHANNEL2TC0_CV" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Counter Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40010094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TC_CHANNEL2TC0_RA" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RA" edc:desc="Register A" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40010098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TC_CHANNEL2TC0_RB" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RB" edc:desc="Register B" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001009C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TC_CHANNEL2TC0_RC" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RC" edc:desc="Register C" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100A0" edc:access="-------------rrr------rrrrrrrrrr" edc:cname="TC_CHANNEL2TC0_SR" edc:impl="0x703FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:desc="Clock Enabling Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:desc="TIOA Mirror" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:desc="TIOB Mirror" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100A4" edc:access="----------------------wwwwwwwwww" edc:cname="TC_CHANNEL2TC0_IER" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100A8" edc:access="----------------------wwwwwwwwww" edc:cname="TC_CHANNEL2TC0_IDR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100AC" edc:access="----------------------rrrrrrrrrr" edc:cname="TC_CHANNEL2TC0_IMR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400100B0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400100C0" edc:access="-------------------------------w" edc:cname="TC0_BCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100C4" edc:access="--------------------------nnnnnn" edc:cname="TC0_BMR" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
