Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.4.57/samg54/edc/ATSAMG54J19.PIC
      <edc:SFRDef edc:_addr="0x400E0808" edc:access="----------------w--ww-w-wwwww-ww" edc:cname="UART1_IER" edc:impl="0x9AFB" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Enable RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Enable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="Enable End of Receive Transfer Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="Enable End of Transmit Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Enable Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Enable Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Enable Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Enable TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Enable Buffer Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Enable Buffer Full Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Enable Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E080C" edc:access="----------------w--ww-w-wwwww-ww" edc:cname="UART1_IDR" edc:impl="0x9AFB" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Disable RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Disable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="Disable End of Receive Transfer Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="Disable End of Transmit Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Disable Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Disable Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Disable Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Disable TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Disable Buffer Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Disable Buffer Full Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Disable Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0810" edc:access="----------------r--rr-r-rrrrr-rr" edc:cname="UART1_IMR" edc:impl="0x9AFB" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Mask RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Disable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="Mask End of Receive Transfer Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="Mask End of Transmit Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Mask Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Mask Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Mask Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Mask TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Mask TXBUFE Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Mask RXBUFF Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Mask Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0814" edc:access="----------------r--rr-r-rrrrr-rr" edc:cname="UART1_SR" edc:impl="0x9AFB" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmitter Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmission Buffer Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Match" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0818" edc:access="------------------------rrrrrrrr" edc:cname="UART1_RHR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E081C" edc:access="------------------------wwwwwwww" edc:cname="UART1_THR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0820" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART1_BRGR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="CD" edc:desc="Clock Divisor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0824" edc:access="--------nnnnnnnn-n-n----nnnnnnnn" edc:cname="UART1_CMPR" edc:impl="0xFF50FF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="VAL1" edc:desc="First Comparison Value for Received Character" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:desc="Compare Parity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:desc="Second Comparison Value for Received Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0828" edc:offset="0xBC"/>
      <edc:SFRDef edc:_addr="0x400E08E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="UART1_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x554152"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E08E8" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x400E0900" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UART1_RPR" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:desc="Receive Pointer Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0904" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART1_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
