Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.4.57/samg54/edc/ATSAMG54J19.PIC
      <edc:AdjustPoint edc:_addr="0x400E140C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E1410" edc:access="wwwwwwww--------------------ww--" edc:cname="SUPC_CR" edc:impl="0xFF00000C" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="This bit must always be written to 0." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALSEL" edc:desc="Crystal Oscillator Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYSTAL_SEL" edc:desc="If KEY is correct, switches the slow clock on the crystal oscillator output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1414" edc:access="------------------nn-nnn----nnnn" edc:cname="SUPC_SMMR" edc:impl="0x370F" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="SMTH" edc:desc="Supply Monitor Threshold" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="V1P6" edc:desc="1.6 V" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="V1P72" edc:desc="1.72 V" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="V1P84" edc:desc="1.84 V" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="V1P96" edc:desc="1.96 V" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="V2P08" edc:desc="2.08 V" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="V2P2" edc:desc="2.2 V" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="V2P32" edc:desc="2.32 V" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="V2P44" edc:desc="2.44 V" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="V2P56" edc:desc="2.56 V" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="V2P68" edc:desc="2.68 V" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="V2P8" edc:desc="2.8 V" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="V2P92" edc:desc="2.92 V" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="V3P04" edc:desc="3.04 V" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="V3P16" edc:desc="3.16 V" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="V3P28" edc:desc="3.28 V" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="V3P4" edc:desc="3.4 V" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SMSMPL" edc:desc="Supply Monitor Sampling Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SMD" edc:desc="Supply Monitor disabled" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CSM" edc:desc="Continuous Supply Monitor" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32SLCK" edc:desc="Supply Monitor enables one SLCK period every 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256SLCK" edc:desc="Supply Monitor enables one SLCK period every 256 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_2048SLCK" edc:desc="Supply Monitor enables one SLCK period every 2,048 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMRSTEN" edc:desc="Supply Monitor Reset Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMIEN" edc:desc="Supply Monitor Interrupt Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The SUPC interrupt signal is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The SUPC interrupt signal is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1418" edc:access="nnnnnnnnnn-n------nnnnnn--------" edc:cname="SUPC_MR" edc:impl="0xFFD03F00" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="VDDSEL" edc:desc="VRVDD Field Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The voltage regulator output value is the factory-programmed value." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_VRVDD" edc:desc="The voltage regulator output value is defined by the value programmed in the field VRVDD." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VRVDD" edc:desc="VRVDD Field Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The voltage regulator output value is the factory-programmed value." edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_VRVDD" edc:desc="The voltage regulator output value is defined by the value programmed in the field VRVDD." edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODRSTEN" edc:desc="POR Core Reset Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODDIS" edc:desc="POR Core Disable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core brownout detector is enabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The core brownout detector is disabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:desc="Oscillator Bypass" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on XTALSEL value." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PSWITCH1" edc:desc="SRAM1 Power Switch" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The SRAM1 is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The SRAM1 is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSWITCH2" edc:desc="SRAM2 Power Switch" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The SRAM2 is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The SRAM2 is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
